{
    "version": "https://jsonfeed.org/version/1",
    "title": "Advanced Construct",
    "description": "",
    "home_page_url": "https://advancedconstruct.net",
    "feed_url": "https://advancedconstruct.net/feed.json",
    "user_comment": "",
    "author": {
        "name": "Fodi"
    },
    "items": [
        {
            "id": "https://advancedconstruct.net/sheet-management/",
            "url": "https://advancedconstruct.net/sheet-management/",
            "title": "Sheet management",
            "summary": "<p class=\"msg msg--highlight \">An article on function sheets, action sheets, value sheets, top level sheets... oh, and event sheets of course. And emojis.</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">An article on function sheets, action sheets, value sheets, top level sheets... oh, and event sheets of course. And emojis.</p>\n\n<p>What is an event sheet? A sheet that contains events, right? But what if there is a sheet that only has global variables / constants? Or one containing functions exclusively? Or custom actions, for that matter.</p>\n<p>In the last few years I've been using a system that involves having top level event sheets and four subfolders, one for sheets with custom actions, one for sheets with functions, one for sheets with global values (variables and constants) and one for actual event sheets. The subfolders are named <strong>Actions</strong>, <strong>Events</strong>, <strong>Functions </strong>and <strong>Values</strong>, all sheets in the subfolders are prefixed with the letters \"a\", \"e\", \"f\" and \"v\" respectively, so it's easier to navigate the open tabs.</p>\n<p>In this article I go through the details of this setup (with some sidenotes here and there). I have a <a href=\"https://github.com/fodi/construct-3-projects/raw/refs/heads/main/projectfiles/BlankTemplate.c3p\">blank project template that you can download</a> with the folders and most commonly used event sheets (most of them are empty, prefixed with an underscore).</p>\n<p>A slightly weird thing I also like to do is to add emojis at the end of event sheet names. They act a bit like icons, so when I have a lot of tabs open, it's easier for me to find the one I'm looking for. Emojis also signify the fact that the tabs is an event sheet, and not a layout.</p>\n<p>Okay, let's dive in!</p>\n<h2>Top level sheets</h2>\n<p>Sheets on the top level are assigned to at least one layout. When I'm prototyping, I usually start dumping everything in a top level event sheet, then organize it later by moving everything to other sheets. I like to go fast and do periodic clean-ups after things are in a working state.</p>\n<p>For simpler layouts (eg. the crappy low effort menus that I usually make for jam games and prototypes), I just put all events in a top level sheet, since there aren't too many anyway.</p>\n<p>For complex ones (like levels) I create a top level event sheet (eg. <code>Level 🗺️</code>) and only put event sheet includes in it, nothing else. There's no need to include sheets that only contain functions, global variables or custom actions, as those are all globally available by default. <span style=\"text-decoration: underline;\">Actual</span> event sheets have to be included in top level event sheets though.</p>\n<h2>Actions folder</h2>\n<p>This folder is for sheets with custom actions only, one sheet per object type (or family). The sheet's names match the object or family name, prefixed with the letter \"a\" and suffixed with an emoji, eg. <code>aPlayer 🧑</code>, <code>aEnemy 👾</code>, etc.</p>\n<p>Common custom actions include <code>spawn</code> (which spawns an instance of its object type or family) and <code>tick</code> (which is usually called at every tick and does various things with the instance). If a game has players, and enemies with health, I usually have one called <code>changeHealth</code> on both object types which is called when an instance is damaged or healed. This action takes care of changing the health instance variable, doing audio and visual feedback based on the change, checking if health is zero and doing the destruction of the instance, if needed.</p>\n<h2>Events folder</h2>\n<p>This folder is for <span style=\"text-decoration: underline;\">actual</span> event sheets, only containing events (sometimes enclosed in groups). These sheets have to be included in at least one top level event sheet in order to work (unlike <strong>function</strong>, <strong>action</strong> and <strong>value</strong> sheets). I never put any global variables, constants, custom actions or functions in these sheets.</p>\n<p>Sheets in this folder are named according to the kind of conditions (mostly triggers) that are in them. Here are the ones I use most frequently:</p>\n<ul>\n<li><code>eCollisions 💥</code> for \"On collision with another object\" events only. I used to put overlap checks in here too, but nowadays I usually do those inside <code>tick</code> custom actions instead (and other non-trigger events too). I find it very handy to have all collision checks in a single sheet. Sidenote: when setting up collision checks, I try to set the first object to the one that (probably) has fewer instances in a layout, and the second to the one that (probably) has more. (I read somewhere that this has better performance.)</li>\n<li><code>eCreated ✨</code> for \"On created\" events only, and only for object types / families that have instances on a layout at start, not ones that are dynamically spawned during runtime. In the former case, I usually make an <code>init</code> custom action that does initialization for the object and call it from the \"On created\" event.<br>If an object type only spawns dynamically during runtime, I usually have a <code>spawn</code> custom action for it that takes care of the spawning and any initialization as well. At least one instance of these objects is in a \"repository layout\" - nowadays I name it <code>@ Templates</code>.</li>\n<li><code>eTimers ⏰</code> for \"On timer\" events only. Sidenote: don't forget to add a \"for each\" to \"On timer\" events if there's a chance that multiple instances of the same object might finish their timer in the same tick. Because if that happens and there's no \"for each\", only one instance will be picked by the \"On timer\" trigger, which is a bit of a footgun, if you ask me (by the way I'm also planning an article on Construct 3 footguns). There's a <a href=\"each\" target=\"_blank\" rel=\"noopener noreferrer\">warning in the official docs</a> about this behaviour.</li>\n<li><code>eTweens 🌓</code> for the Tween behaviour's \"On finished\" events only. (As far as I know, there's no need to \"for each\" those like Timers.)</li>\n<li><code>eInput_Global 🔘</code> and <code>eInput_Level 🕹️</code> for anything that is input related: keyboard, mouse, touch and game pad events including triggers and non-triggers (eg. \"is down\"). <code>eInput_Global 🔘</code> contains input handling that needs to run on all layouts (eg. toggling full screen or restarting the whole game during early development) - this also means that it's included in multiple top level event sheets. <code>eInput_Level 🕹️</code> only has input handling related to the level and I usually have events split into multiple groups: one for player movement (or one for each player in a local multiplayer game), one for UI, one for developer cheats and so on.</li>\n<li><code>eSystem ⏱️</code> exclusively for events from the \"System\" category. Usually it contains a single \"On start of layout\" event and a single \"Every tick\" event with function and custom action calls mostly. Any other triggers from the \"System\" category also go in this sheet, eg. \"On signal\", \"On canvas snapshot, \"On save complete\", etc.</li>\n</ul>\n<p>Here are some less frequently used ones:</p>\n<ul>\n<li><code>eAnimations 🎞️</code> for animation related trigger events like \"On finished\" and \"On frame changed\".</li>\n<li><code>eMovement 🏃</code> for movement behaviour related triggers, like \"On landed\" for the Platform behaviour, \"On step\" for the Bullet behaviour, \"On target acquired\" for the Turret behaviour, et cetera.</li>\n</ul>\n<h2>Functions folder</h2>\n<p>This is for sheets containing functions only.</p>\n<p>There's usually one called <code>fUtilities 🧰</code>, which contains a handful of frequently used math functions that calculate and return values like <code>volumePercentToDb</code>, <code>distance3D</code>, <code>expDecay</code>. I also have <code>toggleFullscreen</code> which requests or cancels full screen mode and <code>toggleLayer</code> which simultaneously enables or disables the visibility and interactivity of a given layer.</p>\n<p>In almost all projects I have a sheet called <code>fLevel 🎬</code>, which has \"game life cycle\" functions like <code>initLevel</code>, <code>endGame</code> and other global functions that do a lot of things with a lot of objects.</p>\n<p>In some projects I used to have a sheet called <code>fAudio 🎵</code> for functions like <code>playSFX</code> and <code>playBGM</code> to play sound and music according to the current volume settings, with optional debouncing and random variations for sound effects. Nowadays I prefer making an <code>aAudio 🎵</code> sheet in the Actions folder and put similarly named custom actions on the Audio object.</p>\n<p>Sidenote: <a href=\"https://github.com/fodi/construct-3-projects/raw/refs/heads/main/projectfiles/BlankTemplate.c3p\">my blank project template</a> also includes the <code>fRules 📜</code> sheet, with a very specific set of functions, for loading a default ruleset for the game from a JSON file and allowing URL parameter based rule overrides to help with balancing / testing. It's a whole thing, I'll probably write an article about it at one point :)</p>\n<h2>Values folder</h2>\n<p>The <code>Values</code> folder is for sheets containing global variables and constants only. I have a fixed set of 4 sheets in this folder:</p>\n<ol>\n<li><code>vPrimitives 🍞</code> contains global constants that hold a handful \"primitive\" values and characters that I use frequently. It usually has these:\n<ul>\n<li><code style=\"font-weight: var(--font-weight-normal);\">NOTHING</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> with the numeric value of </span><code style=\"font-weight: var(--font-weight-normal);\">-1</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">, which is the next best thing to null (which is not a thing in Construct). Eg. if I have an instance variable for storing object UIDs, I use this to \"clear\" its value, since it's not a valid UID. Some system expressions </span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">also return </span><code style=\"font-weight: var(--font-weight-normal);\">-1</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> (eg. <code>find</code> when there are no results), so it comes handy for comparisons too.</span></li>\n<li><code>NO</code> and <code>YES</code>: with the numeric values <code>0</code> and <code>1</code> respectively. I almost never use the boolean data type in Construct, I use numbers with these values. My main beef with booleans in Construct 3 is that I can't pass a dynamic value to a function or custom action with a boolean parameter. When calling it, I have to use a checkbox to either pass true or false, I cannot pass the result of an expression or a variable. Because of this I refrain from using boolean variables in functions and custom actions, and use the numbers 0 and 1 instead.</li>\n<li><code>EMPTY</code>, which is an empty string, the <code>NOTHING</code> of string variables. I use it to clear a string variable or to check if it's empty.</li>\n<li><code>COMMA</code>, <code>UNDERSCORE</code>, <code>SPACE</code> and <code>DOT</code>: single character string constants that contain a comma, an underscore, a space and a dot (or full stop, period, etc) respectively. I use <code>DOT</code> when specifying JSON object paths (yes, I really hate string literals), the rest are for dealing with comma / underscore / space delimited strings (eg. \"cheapskate arrays\"), eg. with <code>tokenat</code> and <code>tokencount</code>.</li>\n</ul>\n</li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">vNames 🗃️</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> contains global constants that act as \"enums\" or \"macros\" (not sure of the right terminology). I have a whole </span><a href=\"https://advancedconstruct.net/using-global-names/\" style=\"font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">article on \"global names\"</a><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> that goes into details on what is in this sheet.</span></li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">vConfig 💎</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> contains global constants prefixed with C_, which are all magic numbers or magic strings that do not need to change during runtime. The contents vary with the project, but here are some real-life examples from our game </span><a href=\"https://lasermagnet.itch.io/wordpile\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Wordpile</a><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">:</span>\n<ul>\n<li><code style=\"font-weight: var(--font-weight-normal);\">C_Tile_TweenOut_Time</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: tween time for fading out a Tile object.</span></li>\n<li><code>C_DIR_Layouts</code>: path of the folder inside the project files that contains level layouts (which are loaded via AJAX).</li>\n<li><code>C_UI_Hold_Interval</code>: the amount of time a player needs to press a certain button to activate its secondary function.</li>\n<li><code>C_Color_Red</code>: a certain red color value (in this case <code>-281479422673919</code>) that I use in a some \"set color\" actions.</li>\n<li><code>C_Player_Count_Max</code>: hard limit of players that can join a local multiplayer game.</li>\n</ul>\n</li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">vState ♻️</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> contains global variables (no constants) only that hold internal state of the game. These are camel cased by default, but sometimes I group them with prefixes and use an underscore after a prefix. Some random examples:</span>\n<ul>\n<li><code>locale</code>: contains 2 character code for the currently selected UI language (eg. \"en\"), used for configuring the Internationalization plugin after the a language is chosen on the UI.</li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">volumePercentBGM</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> and </span><code style=\"font-weight: var(--font-weight-normal);\">volumePercentSFX</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: 0-100 values of the background music and sound effects.</span></li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">level_seed</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: current seed of the level used for initializing the AdvancedRandom object.</span></li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">level_currentPlayerId</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: contains which player's turn is it in a multiplayer game (0 for first player, 1 for second, etc).</span></li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">level_penaltyTotal</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: when the level ends, the player gets an amount of penalty points based on how they did and it gets tallied up in this variable.</span></li>\n</ul>\n</li>\n</ol>\n<p>That's about it, really. The system hasn't changed much recently, but sometimes I do decide to rename or restructure a few things. I'll try to keep this article updated if that happens.</p>",
            "image": "https://advancedconstruct.net/media/posts/20/event-sheets.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Organization"
            ],
            "date_published": "2025-09-16T19:06:36+02:00",
            "date_modified": "2025-09-21T10:54:45+02:00"
        },
        {
            "id": "https://advancedconstruct.net/downloadable-projects/",
            "url": "https://advancedconstruct.net/downloadable-projects/",
            "title": "Downloadable projects",
            "summary": "<p>I have some free template &amp; example projects, all available under the MIT license.</p>\n",
            "content_html": "<p>I have some free template &amp; example projects, all available under the MIT license.</p>\n\n<p>You can find a list of projects and demos here:<br><a href=\"https://fodi.github.io/construct-3-projects/\">https://fodi.github.io/construct-3-projects</a></p>\n<p>The source code for the projects are in this monorepo inside the `projectfolders` folder:<br><a href=\"https://github.com/fodi/construct-3-projects\">https://github.com/fodi/construct-3-projects</a></p>\n<p>I also have some open source projects hosted on Itch.io, you can find them in this collection:<br><a href=\"https://itch.io/c/6291129/fodis-open-source-projects\">https://itch.io/c/6291129/fodis-open-source-projects</a></p>\n<p>Have fun!</p>\n<p>If you find any of them useful, and would like to <a href=\"https://buymeacoffee.com/fodi\" target=\"_blank\" rel=\"noopener noreferrer\">buy me a coffee</a>, you can :)</p>",
            "image": "https://advancedconstruct.net/media/posts/18/downloadable-projects.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
            ],
            "date_published": "2025-09-01T21:29:50+02:00",
            "date_modified": "2025-09-21T10:57:08+02:00"
        },
        {
            "id": "https://advancedconstruct.net/project-organization/",
            "url": "https://advancedconstruct.net/project-organization/",
            "title": "Project organization",
            "summary": "<p>I'd like to cover many things on this topic, so here's a list showing which article's available and what's planned.</p>\n",
            "content_html": "<p>I'd like to cover many things on this topic, so here's a list showing which article's available and what's planned.</p>\n\n<h2>Available</h2>\n<ul>\n<li><strong><a href=\"https://advancedconstruct.net/using-global-names/\">Using \"global names\"</a></strong><br>Construct does not have enums and uses string literals in some places where an enum would be more convenient. Here's a way to get almost all benefits of enums.</li>\n<li><strong><a href=\"https://advancedconstruct.net/sheet-management/\">Sheet management</a></strong><br>A system composed of top level or \"main\" sheets, action sheets, function sheets, value sheets and <span style=\"text-decoration: underline;\">actual</span> event sheets.</li>\n</ul>\n<h2>Planned</h2>\n<ul>\n<li><strong>Object &amp; family conventions</strong><br>Naming and grouping, typical hierarchies, instance variable and custom action usage</li>\n<li><strong>Global object(s)</strong><br>Also known as the level or game manager object, a singleton, or autoload in Godot-land. I use it to keep state between layouts, run timers and value tweens not related to objects and a few other minor things.</li>\n<li><strong>Code reuse and structuring</strong><br>How and when I use functions, custom actions and event groups.</li>\n</ul>\n<p> </p>",
            "image": "https://advancedconstruct.net/media/posts/17/project-organization.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Organization"
            ],
            "date_published": "2025-08-30T11:20:29+02:00",
            "date_modified": "2025-09-21T10:57:51+02:00"
        },
        {
            "id": "https://advancedconstruct.net/using-global-names/",
            "url": "https://advancedconstruct.net/using-global-names/",
            "title": "Using &quot;global names&quot;",
            "summary": "<p class=\"msg msg--highlight \">String literals? Yuck. More typo protection, better autocompletes, enhanced usage lookups? Yes please!</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">String literals? Yuck. More typo protection, better autocompletes, enhanced usage lookups? Yes please!</p>\n\n<p>OG Construct developer <a href=\"https://bsky.app/profile/salmanshh.bsky.social\">Salman Shurie</a> referred to the engine's event system as \"super intellisense\" a couple of times - turns out the phrase was coined by <a href=\"https://bsky.app/profile/wtfmig.bsky.social\">@wtfmig</a>. Nevertheless, I think it's on point.</p>\n<p>When you're using the event system (and no JS/TS code), you can't mistype names of variables, constants, behaviours, objects, families or functions, because the editor simply won't let you. You can also rename any of these without worrying about breaking code, Construct automatically updates all references to reflect the name change (again, as long as they are not mentioned in JS/TS code). If you're using the paid version, the editor can also find all usages of variables, constants, objects and family members. It's an amazing tool and I use it countless times during development.</p>\n<p>There are some things you can still mistype, since they are not structured as identifiers, but strings. Layer names, animation names, effect names, various tags (for tweens, timers, sounds, et cetera) can be entered as string literals. Construct tries to suggest them, but you can still make a typo and you don't get usage finding. And if you decide to rename a layer, animation, effect or any sort of tag, you'll have to manually search for it and change it manually by hand which is tedious and error prone.</p>\n<p>Rather than doing that, you can create global constants (which are identifiers) and use them instead of string literals. This way you get typo protection, usage lookups and renaming things is a lot easier once you resist the urge to use string literals in those cases. Granted, there's an extra step (creating a global constant), but I think it's worth the effort.</p>\n<p>In my projects I put all \"global name\" constants in an event sheet called <code>vNames</code>. Since it only contains variables, it's automatically \"included\" in all events sheets, so you don't have to worry about importing it. (By the way the same goes for functions and custom actions too; only sheets containing events have to be included to run.)</p>\n<p>You can also apply a naming convention on the global \"name\" constants to signify their \"kind\", eg:</p>\n<ul>\n<li><code>LAYER_Main = \"Main\"</code> (value matches the layer name)</li>\n<li><code>TIMER_Invincibility = \"Invincibility\"</code> (timer tag)</li>\n<li><code>TWEEN_FadeIn = \"FadeIn\"</code> (tween tag)</li>\n<li><code>EFFECT_Brightness = \"Brightness\"</code> (value matches an effect name)</li>\n<li><code>ANIM_Idle = \"Idle\"</code> (value matches an animation name)</li>\n</ul>\n<p>...or you can even add the names of the related family or object type, so there's no reuse between different types:</p>\n<ul>\n<li><code>TIMER_Player_Invincibility = \"Player_Invincibility\"</code></li>\n<li><code>TWEEN_Enemy_Opacity_FadeIn = \"Enemy_Opacity_FadeIn\"</code> (also includes the \"type\" of tween - in this case, opacity)</li>\n<li><code>EFFECT_Item_Brightness = \"Brightness\"</code></li>\n<li><code>ANIM_Enemy_Idle = \"Idle\"</code></li>\n<li><code>ANIM_Player_Idle = \"Idle\"</code></li>\n</ul>\n<p>Lately I've been doing the latter which has two additional benefits:</p>\n<ul>\n<li>Less confusion when finding references, since every name is specific to an object type or a family</li>\n<li>Less typing / better autocompletion: eg. I can type ANIM_ to get a list of all animation names, continuing typing the object/family name filters the list even further so it's easy to choose one with the arrow keys</li>\n<li>Tidier vNames sheet: alphabetically sorting global names means they are grouped by type and object / family.</li>\n</ul>",
            "image": "https://advancedconstruct.net/media/posts/14/global-names-2.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Organization"
            ],
            "date_published": "2025-08-13T21:56:00+02:00",
            "date_modified": "2025-09-21T10:59:26+02:00"
        },
        {
            "id": "https://advancedconstruct.net/finding-things-in-construct/",
            "url": "https://advancedconstruct.net/finding-things-in-construct/",
            "title": "Finding things in Construct",
            "summary": "<p class=\"msg msg--highlight \">Let's take a look at the tools in Construct that let you find stuff.</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">Let's take a look at the tools in Construct that let you find stuff.</p>\n\n<p>Like in most development environments you can <strong>perform a text search</strong> by pressing <em>Ctrl</em> + <em>F</em>. Construct allows you to specify the scope of your search, toggle case sensitivity and you can even perform a second search to further filter down search results, which is especially handy when you have a lot of them. You can also <strong>remove results</strong> by selecting them and pressing <em>Delete</em> (re-running the search will bring them back).</p>\n<p>If you're editing a code block or a text file, <em>Ctrl</em> + <em>F</em> brings up a different toolbar that allows you to <strong>find (and even replace) text</strong>. The toolbar might look familiar if you're a VSCode user, since both are powered by the open source Monaco code editor which replaced the old CodeMirror 5 based one in Construct 3 r432. It also has nifty features like renaming identifiers by pressing <em>F2</em> and a bunch of other which you can find in the Command palette. Just note that the scope is always the current code block or tab.</p>\n<p>As your project grows, you might end up scrolling a lot up and down the project bar to <strong>find event sheets, objects, files</strong>, et cetera; luckily there's a search field you can focus by pressing <em>Ctrl</em> + <em>Shift</em> + <em>F</em> and just start typing to find matches.</p>\n<p>Since Construct is running in the browser you can still use the generic find tool, which can be especially useful for <strong>highlighting text on your screen</strong>. Press <em>Ctrl</em> + <em>G</em> to bring it up (since <em>Ctrl</em> + <em>F</em> is overridden to use Construct's own find feature).</p>\n<p>A super useful feature (unfortunately missing from the free version) is that you can right click any object, family, function, custom action or variable and select \"<strong>find all references</strong>\". In all cases, Construct will compile a list of each \"mention\" in the event sheets. If you selected an object instance, object type or family, you'll also see the number of instances per layout. If you use the \"Create object (by name)\" system action anywhere, object &amp; family reference lists will also include those actions as well just to be on the safe side; you can hide those results by unchecking \"Show ambiguous\".</p>\n<p>If you opt in to use <strong>\"global names\"</strong> instead of string literals to reference names of animations, layers, effects, various tags and such in your event sheets, you'll also be able to find all mentions of those using the \"find all references\" feature. Not to mention the added bonus of typo protection and easy renaming. <a href=\"#non-existing-post-with-id-7\">Read more about \"global names\" here!</a></p>\n<p>When making changes to a fairly complex project it's easy to get lost jumping between event sheets (especially if you have about 20 of them open). In such a scenario I like to use the often forgotten <strong>bookmarks feature</strong>. The <strong>Bookmarks bar</strong> is not open by default, but I usually have it open all the time docked in the bottom left corner, just taking a bit of space from the <strong>Properties bar</strong>. When you're in an event, you can press <em>F2</em> to bookmark it, which adds an easy to spot icon next to the event and adds it to the Bookmarks bar, where you can double click it to jump right to it. Just don't forget to remove old bookmarks you no longer need: the easiest way is to right-click the bar and select <strong>Remove All</strong>.</p>",
            "image": "https://advancedconstruct.net/media/posts/13/finding-things.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Productivity"
            ],
            "date_published": "2025-08-13T20:38:00+02:00",
            "date_modified": "2025-09-21T11:00:04+02:00"
        },
        {
            "id": "https://advancedconstruct.net/keyboard-mastery/",
            "url": "https://advancedconstruct.net/keyboard-mastery/",
            "title": "Keyboard mastery",
            "summary": "<p class=\"msg msg--highlight \">Switching between the mouse and keyboard can slow you down when you're working in event sheets. But keyboard shortcuts save the day!</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">Switching between the mouse and keyboard can slow you down when you're working in event sheets. But keyboard shortcuts save the day!</p>\n\n<p>One of the best ways to increase your productivity in any software is to learn keyboard navigation and shortcuts. Construct has very good \"keyboard coverage\", especially in event sheets.</p>\n<p>I find that switching between keyboard and mouse slows me down and doesn't help with my flow either, so I re-read the list of keyboard shortcuts in the official docs from time to time and try incorporating more of them in my workflow.</p>\n<p>You can <a href=\"https://www.construct.net/en/make-games/manuals/construct-3/interface/keyboard-shortcuts\">check out the list of Construct's keyboard shortcuts here</a>, and you might want to bookmark it too while you're there. I highly recommend starting with the shortcuts for the event sheet view, but if you spend a lot of time in the animation editor, those shortcuts come super handy as well.</p>\n<p>Moving the cursor (or selection) via keyboard in event sheets might be a bit awkward at first, but I think it's worth the effort to learn it.</p>\n<p>More seasoned developers probably know most cursor navigation shortcuts too, but just in case, here's a little refresher. (Note that these are for Windows, they probably work on Linux, possibly on macOS with some modifications.)</p>\n<ul>\n<li><em>Home</em> / <em>End</em> moves the cursor to the start or end of the line</li>\n<li><em>Ctrl</em> + <em>Home</em> / <em>End</em> to move to the start or end of the document</li>\n<li><em>Page up</em> / <em>Page down</em> does what it says on the tin :)</li>\n<li><em>Ctrl</em> + <em>Left</em> / <em>Right</em> arrow keys move the cursor by one word. What constitutes a word might vary based on the app or your OS; spaces and special characters are word delimiters most of the time with some exceptions (eg. underscore usually is not, hyphen-minus-dash depends).</li>\n</ul>\n<p>All of the above can be combined with <em>Shift</em> to select text.</p>\n<p>Since Construct is running in a browser, it's worth learning some of those shortcuts (these might depend on your browser or OS as well), especially:</p>\n<ul>\n<li><em>Ctrl</em> + <em>R</em> to reload; add Shift to force your browser to ignore the local cache</li>\n<li><em>Ctrl</em> + <em>W</em> to close a tab (including Construct, careful :), add <em>Shift</em> to close all tabs in the current window</li>\n<li><em>Ctrl</em> + <em>Shift</em> + <em>I</em> to open developer tools</li>\n</ul>",
            "image": "https://advancedconstruct.net/media/posts/12/mouse-slow.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Productivity"
            ],
            "date_published": "2025-08-13T20:10:00+02:00",
            "date_modified": "2025-09-21T11:00:33+02:00"
        },
        {
            "id": "https://advancedconstruct.net/backing-up-construct-projects/",
            "url": "https://advancedconstruct.net/backing-up-construct-projects/",
            "title": "Backing up Construct projects",
            "summary": "<p class=\"msg msg--highlight \">Backups are crucial if you don't want to have a bad time. And don't just use one! Here's how I do it.</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">Backups are crucial if you don't want to have a bad time. And don't just use one! Here's how I do it.</p>\n\n<p>Data loss sucks and will happen to everyone, so back up your stuff and not only in one place. Consider hot &amp; cold backups, automatic and manual ones, and periodically verifying backups, especially for important stuff.</p>\n<p>My method is to put all of my <strong>Construct projects inside Dropbox</strong>, and since I'm almost always online that's already a form of automatic backup, since Dropbox detects when I save a project, immediately pushes the change to the server (and keeps a few versions back as well). I use c3p project files (because I like to put emojis in my event sheet names - don't judge :D - and those don't sync at time of writing). A disadvantage is that saving is a bit slower due to the extra zipping step, but my projects are usually not too big, so that's not a big issue for me.</p>\n<p>Every few hours I <strong>save the project with a new file name</strong> (eg MyProject-v01, then MyProject-v02, etc), which also constitutes a form of versioning. If you prefer working with project folders, git is probably the best idea; just don't forget to commit and push to remote (eg. GitHub, GitLab, whatever floats your boat) regularly.</p>\n<p>I also use <strong>GitHub for manual backups</strong> by converting my c3p files into git commits with <a href=\"https://github.com/fodi/c3p2git\">this script</a> and pushing them to remote every once in a while (note that I'm only doing hobby stuff). Since I use 3 PCs for work (one of the reasons I went with Dropbox) they also act as offline snapshots; in case something goes terribly wrong with the contents of my Dropbox, I can boot one of the PCs disconnected form the Internet and make a backup of the (hopefully valid) state of my Dropbox.</p>\n<p><strong>Construct has an automatic backup feature</strong> and you should use it. You can set it up with a cloud provider or just a local folder. I do the latter one, but the folder is inside my Dropbox too. I can't vouch for other sync providers, but there's a good chance Google Drive, OneDrive, Mega and Syncthing are viable options.</p>",
            "image": "https://advancedconstruct.net/media/posts/11/backup.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Basics"
            ],
            "date_published": "2025-08-13T19:56:00+02:00",
            "date_modified": "2025-09-21T11:00:59+02:00"
        },
        {
            "id": "https://advancedconstruct.net/setting-up-construct/",
            "url": "https://advancedconstruct.net/setting-up-construct/",
            "title": "Setting up Construct",
            "summary": "<p class=\"msg msg--highlight \">There's more then one way to install Construct. Are you using the most convenient one?</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">There's more then one way to install Construct. Are you using the most convenient one?</p>\n\n<p>Even though my daily driver is Mozilla Firefox (because I'm an intermediate privacy nut and I don't want to wonder around the Internet without <a href=\"https://addons.mozilla.org/en-US/firefox/addon/ublock-origin\">an uncrippled version of uBlock Origin</a>), I run Construct in <strong>Chromium</strong>. I chose it because:</p>\n<ul>\n<li>Chromium seems to run games with better performance compared to Firefox. The difference is especially apparent in 3D games, but most of my 2D games also have better frame rates on Chromium based browsers.</li>\n<li>I can install Construct as a <a href=\"https://developer.mozilla.org/en-US/docs/Web/Progressive_web_apps\" title=\"progressive web app\" target=\"_blank\" rel=\"noopener noreferrer\">PWA</a> with it, which comes with a launcher icon, more screen space and .c3p file association which is neat. It almost feels like a native app.</li>\n<li>Google Chrome and Microsoft Edge are <a href=\"https://en.wikipedia.org/wiki/Usage_share_of_web_browsers\" target=\"_blank\" rel=\"noopener noreferrer\">very popular browsers</a> and are both based on Chromium (as are Opera and Brave). If something is not working in Chromium, it probably won't work in Chrome, Edge, Opera or Brave either.</li>\n<li>Chromium is open source and doesn't push Google crap, Microsoft crap or cryptocurrencies. At the time of writing :)</li>\n</ul>\n<p class=\"msg msg--info\"><strong>Side note</strong><br>I use the <a href=\"https://github.com/Hibbiki/chromium-win64/\">Chromium build by Hibbiki</a>, which I installed and keep updated with <a href=\"https://scoop.sh/\">scoop</a>. Other alternatives include the <a href=\"https://chromium.woolyss.com/\">Woolyss build</a> and <a href=\"https://github.com/ungoogled-software/ungoogled-chromium\">Ungoogled Chromium</a>. I personally don't mind the small amount of Google stuff in the build I use, especially because I barely use it for anything other then running Construct.</p>\n<p>If you don't have concerns about Google Chrome, Microsoft Edge, Opera or Brave, just use any of them, Construct should run well in all of them.</p>\n<p>On Windows 10 and newer you also have the option to install Construct 3 from the <strong>Microsoft Store</strong>; I'm guessing it's a similar experience to installing the PWA with Microsoft Edge.</p>\n<p>When you open the Construct editor for the first time, it immediately starts downloading the necessary files for offline use and will let you know via a notification in the bottom left when it's ready.</p>\n<p>If you're planning to<strong> use Construct offline</strong>, make sure you open a project and run a preview, as some browsers might prevent Construct from caching the files needed to run projects. Also don't forget to log in while online before going off the grid.</p>",
            "image": "https://advancedconstruct.net/media/posts/9/setting-up.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Basics"
            ],
            "date_published": "2025-08-13T19:53:00+02:00",
            "date_modified": "2025-09-21T11:01:33+02:00"
        },
        {
            "id": "https://advancedconstruct.net/introduction/",
            "url": "https://advancedconstruct.net/introduction/",
            "title": "Introduction",
            "summary": "<p>Hi there! Welcome to <strong>Advanced Construct</strong>, an attempt to share knowledge I gathered since Construct 3 and game development became my hobby in 2020.</p>\n",
            "content_html": "<p>Hi there! Welcome to <strong>Advanced Construct</strong>, an attempt to share knowledge I gathered since Construct 3 and game development became my hobby in 2020.</p>\n\n<p>I'm <a href=\"https://fodi.be\" target=\"_blank\" rel=\"noopener noreferrer\">Fodi</a>, a millennial web developer from Hungary. My plan is to continuosly update this site with articles, and if there's traction, videos as well. Some might age like milk, some might hold up better. Instead of procrastinating or spending too much time with editing, I'm just going to post things.</p>\n<p>I'll try to cover various Construct 3 related topics, more specifically:</p>\n<ul>\n<li><a href=\"https://advancedconstruct.net/tags/basics/\">Basics</a> to improve your developer experience (like setting up the Construct Editor, project backups, et cetera).</li>\n<li>Ways to enhance your <a href=\"https://advancedconstruct.net/tags/productivity/\">productivity</a> and development speed in Construct.</li>\n<li>Project <a href=\"https://advancedconstruct.net/tags/organization/\">organisation</a> patterns to keep things relatively clean and easier to build upon.</li>\n</ul>\n<p>If you have questions or feedback, feel free to find me in the <a href=\"https://discord.gg/g4g3VNsynC\" target=\"_blank\" rel=\"noopener noreferrer\">Construct Community Discord</a> and send me a DM.</p>",
            "image": "https://advancedconstruct.net/media/posts/1/intro.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
            ],
            "date_published": "2025-08-13T19:08:52+02:00",
            "date_modified": "2025-09-21T11:02:04+02:00"
        }
    ]
}
