{
    "version": "https://jsonfeed.org/version/1",
    "title": "Advanced Construct",
    "description": "",
    "home_page_url": "https://advancedconstruct.net",
    "feed_url": "https://advancedconstruct.net/feed.json",
    "user_comment": "",
    "author": {
        "name": "Fodi"
    },
    "items": [
        {
            "id": "https://advancedconstruct.net/my-construct-cookbook-2025/",
            "url": "https://advancedconstruct.net/my-construct-cookbook-2025/",
            "title": "My Construct Cookbook (2025)",
            "summary": "<p class=\"msg msg--highlight \">Development principles, practices, patterns and anti-patterns as seen by a random Construct 3 developer (me).</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">Development principles, practices, patterns and anti-patterns as seen by a random Construct 3 developer (me).</p>\n\n<p>I've been using Construct 3 for about 5 years now. So far I've made over 30 jam games, countless experiments and prototypes as a hobbyist. Between 2023 and 2024 I built about a dozen smaller scope browser games for various clients, so I guess I can call myself a professional game developer, but I haven't done a \"proper\" game release on Steam or other big platforms. Although it will probably happen in the future, I have no short term plans to start working on one.</p>\n<p>In this article I attempt to summarise the principles and practices I try to apply as a Construct developer. They seem to work well for me, your mileage may vary.</p>\n<h2>Processes</h2>\n<ul>\n<li><strong>Prototype, clean up, repeat.<br></strong>I'm a big fan of <a href=\"https://www.youtube.com/watch?v=WtDPNoVGZIw\">iterative development</a>, but if there's intention to grow the project into something sustainable, periodic clean-ups and refactors are key. Nobody nails everything for the first time, especially while experimenting with different things instead of following a well thought out \"recipe\". Even if you are, things might turn out to be duds that need to be removed or replaced and usually leave some spaghetti behind. Or hastily coded experiments turn out to be amazing and need to be kept around and built upon. Usually I do clean-ups every third or fourth session on most projects. This is also when I get rid of the sea of \"todo\" comments I made during development, to mark the bit that need to be refactored, fixed or optimised.</li>\n<li><strong>Get to know the tools built by the community.<br></strong>Like <a href=\"https://advancedconstruct.net/construct-resources/\">some of these for example</a>.</li>\n<li><strong>Look for automation opportunities.<br></strong>I don't use a lot of automation, but I do have a script that pushes a fresh HTML5 build of a game to Itch.io (via <a href=\"https://itch.io/docs/butler/\">butler</a>) and to Vercel, and another one that <a href=\"https://github.com/fodi/c3p2git/\">converts my versioned .c3p files into git commits</a> and pushes them to GitHub, which I use as an off-site backup.</li>\n<li><strong>Aid balancing and content creation workflows that take a long time.</strong><br>If you spend a lot of time balancing a game using variables, consider using \"rule\" files in an easy to edit format (eg. JSON – or JS, so you can have comments, trailing commas and includes). Rule files should contain the values that need to be balanced, ideally in a <a href=\"https://fodi.itch.io/free-version-survivors\">nice structure</a>. With rule files, changes are easier to track and merge, and it can even act as a data source for generating change logs. A basic rule system can be extended to provide an in-game editor, URL parameter based overrides (eg. <code>?Player_Health=150</code>), portability (saving/loading to local storage, the file system or an API), just to mention a few. I have a basic rules-and-overrides system in <a href=\"https://github.com/fodi/construct-3-projects/raw/refs/heads/main/projectfiles/BlankTemplate.c3p\">my \"blank\" project template</a>, because I used it quite a few times lately.</li>\n<li><strong>Consider your dependencies.</strong><br>Relying on third party addons or services has advantages and disadvantages as well. In general I try to keep my dependencies as low as possible. Limitations fuel creativity anyway!</li>\n<li><strong>Write todo lists and change logs.</strong><br>If you're a solo developer (or just prototyping on your own), why not store todo lists and change logs inside the project as files? I've started doing that recently. When I finish something from the todo list, I move it to the change log (with added details if needed), bang. You can even add them to your in-game menu, so players can track what changed and when.</li>\n</ul>\n<h2>Setup</h2>\n<ul>\n<li><a href=\"/setting-up-construct/\">Set up the Construct editor</a> as a PWA to maximise screen space and take full advantage of the extra features (eg. file associations, application shortcut).</li>\n<li>Avoid unnecessary frustration: prevent data loss &amp; keep \"checkpoints\" throughout development. I have an article on <a href=\"/backing-up-construct-projects/\">how I back up my projects in Construct</a>; in short, it's one versioned c3p project file per build, stored in Dropbox, eventually converted to git commits and pushed to GitHub.</li>\n<li>Learn <a href=\"/keyboard-mastery/\">hotkeys and keyboard navigation</a>, which are especially useful in event sheets. It can be a very nice boost to productivity (and for me it's a lot less frustrating), especially if you're good touch typing. If not, <a href=\"https://www.keybr.com/\">practice</a> :)</li>\n<li>Get to know <a href=\"/finding-things-in-construct/\">the features that help you get around in projects</a> and organize your program structure so you can take full advantage of them (more on that later).</li>\n<li>Use a template project that has all the boilerplate you need every time (or almost every time). You can <a href=\"https://github.com/fodi/construct-3-projects/raw/refs/heads/main/projectfiles/BlankTemplate.c3p\">download mine</a>, but it's very opinionated and might not make sense to you. In general, if you find yourself re-implementing the same thing for multiple projects (eg. I have one for <a href=\"https://github.com/fodi/construct-3-projects/raw/refs/heads/main/projectfiles/EightDirectionPlayer+SmoothCamera.c3p\">top-down player movement and camera</a>), it's probably a good idea to turn it into a template, so you can hit the ground running faster when starting a new project.</li>\n</ul>\n<h2>Development patterns</h2>\n<ul>\n<li><a href=\"/using-global-names/\">Using \"global names\"</a> and <a href=\"https://advancedconstruct.net/sheet-management/\">sheet organization</a> are two topics I've covered in length, so let's see the other ones :)</li>\n<li><strong>Use naming conventions for:</strong>\n<ul>\n<li><strong>Object types</strong><br>...so they are easier to find when typing their name (eg. <code>Player</code>, <code>PlayerCamera</code>, <code>PlayerHurtbox</code>). Optionally you can apply prefixes that relate to their \"type\" (eg. 3D object textures, 2.5D billboards, etc: <code>txGrass</code>, <code>txConcrete</code>, <code>bbPlayer</code>, <code>bbEnemy</code>, etc).</li>\n<li><strong>Functions </strong>and <strong>custom actions</strong><br>Where it makes sense, and stick to it. Some random examples: an <code>onInput</code> custom action on the Player object that handles one-off button presses, an <code>onClick</code> custom action to handle mouse or touch interactions on a button, Enemy custom actions named <code>spawn</code> and <code>spawnGroup</code>, one spawns a single enemy instance, the other spawns a specified number of enemies in a formation.</li>\n</ul>\n</li>\n<li><strong>Use folders to group elements of your project.</strong><br>Object types, event sheets, files, et cetera – especially if you have a lot of them, so they're easier to locate compared to the default alphabetised list.</li>\n<li><strong>Use a level and/or game manager object instead of global variables where appropriate.</strong><br>Resetting global variables can be a pain if some of them need to be kept. Destroying and recreating a global object is easier and it also helps to separate level or game state variables from miscellaneous stuff.</li>\n<li><strong>Use the keyboard as much as possible in event sheets.</strong><br>Switching between mouse and keyboards slows me down quite a bit and I prefer the keyboard for programming. Construct as excellent search and autocomplete coverage, you can create events, variables, functions, custom action, groups, code snippets without using your mouse.</li>\n</ul>\n<h2>Development anti-patterns</h2>\n<p>Some of these are heavily influenced by the fact that I prefer keyboard navigation in event sheets and I use \"find all references\" a lot to get around a project.</p>\n<ul>\n<li><strong>Using string literals as identifiers.</strong><br>See my article on <a href=\"/using-global-names/\">\"global names\"</a> for details.</li>\n<li><strong>Using \"On created\" for objects that are dynamically spawned.</strong><br>On created is useful for initialising objects that are on a layout at start. For dynamically spawned objects, I usually have a <code>spawn</code> custom action on a, essentially a wrapper for a \"Create object\" system action which also handles or calls any initialisation.</li>\n<li><strong>Using \"On destroyed\".</strong><br>I can imagine some rare cases where this could make sense, but using a custom action for handling destruction of objects has better readability, and you can search for references to the custom action too.</li>\n<li><strong>Using groups solely for organisation, using long event sheets and nested groups.</strong><br>At the time of writing there's no keyboard shortcut to expand or collapse things (including groups) in the event sheet. I prefer splitting events into multiple event sheets that you can have open side by side.</li>\n<li><strong>Using global constants / variables anywhere else but one of the \"value\" sheets.<br></strong>Having them grouped together by type in separate event sheets makes them easier to locate. These sheets act like a \"table of contents\", you can use \"find all references\" as a jump-off point to locate where they are used.</li>\n<li><strong>Using extraneous object types for UI when grouping them together makes more sense.</strong><br>I use an instance variable named <code>role</code> instead. A random example: if I have a screen with 10 buttons that can each trigger a special skill of the player, I create a single object type (eg. <code>UI_Button_Skill</code>), and set the <code>role</code> instance variable on each with a different unique value. If a <code>UI_Button_Skill</code> object is clicked, a custom action (eg. <code>onClick</code>) is called with the <code>role</code> instance variable passed to it as a parameter. This custom action takes care of the validation (eg. if the skill is not on cooldown) and activates the skill if possible.</li>\n<li><strong>Using the Audio object's \"play\" actions directly.</strong><br>Instead, I usually have a single <code>PlaySFX</code> custom action on the Audio object, which implements debouncing, sound effect variant randomization, an optional volume multiplier (for balancing the volume of sound effects). It can be extended to add positional audio or anything else you might need. Similarly, I usually have a <code>PlayBGM</code> custom action too, which handles changing the background music.</li>\n<li><strong>Keeping \"template\" object instances for dynamically spawned objects anywhere else but a designated \"object templates\" layout (aka. \"object repository\", \"repo\", etc).</strong><br>Anything else can lead to ambiguity and thus is more error prone. If the instances are on a separate layout, they are easier to find and change. If the game has \"static\" level designs (made with the layout editor, as opposed to eg. procedurally generated ones), I use statically placed \"spawner objects\" on layouts that will dynamically spawn the real objects based on instances placed on the \"object templates\" layout. These spawners all \"activate\" at the start of the layout and spawn the required object type (optionally with a specified template), with hierarchy if needed.</li>\n<li><strong>Using functions that are (mostly) doing something related to a single object type or family </strong>(unless a return value is needed, which is not possible with custom actions at the moment).<br>I usually have custom actions that initialize or spawn, update (\"tick\") and destroys a certain object type (or family), named <code>init</code> / <code>spawn</code> (depending on whether they are statically or dynamically spawned), <code>tick</code> (that sometimes calls several \"sub custom actions\", like <code>tick_input</code>, <code>tick_movement</code>, <code>tick_attack</code>, etc), <code>remove</code>/<code>kill</code> (which discards the object instance and takes care of anything else related to it, eg. adding a score).</li>\n<li><strong>Using \"every X seconds\" for anything other then prototyping.</strong><br>In the long run Timers almost always work better. Just don't forget to add a \"for each\" condition for \"on timer\" actions if there's a chance multiple instances will finish their timers in the same tick.</li>\n<li><strong>Using \"Wait for previous actions\".</strong><br>Although sometimes it can help make the code more concise, I almost always refactor it so it's no longer needed.</li>\n<li><strong>Multiple events with the same top condition / trigger.</strong><br>I prefer a single event with sub events instead. I group my event sheets by the \"type\" of events contained within the, (eg. <code>eCollisions</code> for collision checks, <code>eSystem</code> for anything from the System category, et cetera - see <a href=\"https://github.com/fodi/construct-3-projects/raw/refs/heads/main/projectfiles/BlankTemplate.c3p\">my \"blank\" template</a> for more examples). I find it easier to locate events this way.</li>\n<li><strong>Using layer IDs.</strong><br>They are indices, so they can change when layers are added, removed or sorted. Instead, I use global constants with a string value matching the layer's name. It helps finding references, and provides an easy way to rename a layer (just change the layer name and the value of the constant).</li>\n<li><strong>Using the boolean type.<br></strong>Since Construct doesn't allow passing a dynamic boolean value to functions or custom actions, I just use the numbers instead. I use two global constants (aka. \"primitives\") called <code>NO</code> and <code>YES</code> with the numeric values 0 and 1 respectively to keep things readable.</li>\n<li><strong>Passing UIDs in function or custom action parameters instead of copying existing picks.<br></strong>If instances are already picked, why pick them again, right?</li>\n<li><strong>Using the \"trigger once\" condition.</strong><br>For some reason it just screams spaghetti for me. I've never felt the need to use it.</li>\n</ul>\n<h1>Things I haven't (really) used in Construct</h1>\n<p>These are features in Construct, that I have zero or almost zero experience with at the moment. There's a good chance I'll use some of them at one point, but I haven't had the need for them yet.</p>\n<ul>\n<li><strong>Timelines</strong><br>If I ever have to do advanced animation in-engine, I'm sure I'll check it out, but I haven't even tried this one.</li>\n<li><strong>Flowcharts</strong><br> I'm pretty sure I'll explore this one in the future, it seems really useful for implementing certain types of mechanics.</li>\n<li><strong>Signals</strong><br>I'm happy with custom actions and functions so far.</li>\n<li><strong>Pure JavaScript or TypeScript projects</strong><br>I'm a web developer by trade (my JS is... okay), but I do almost everything with events. In some cases I sprinkle in some JS code or <a href=\"https://fodi.itch.io/kenney-jam-2021\">glue</a> <a href=\"https://lasermagnet.itch.io/recoupage\">in</a> <a href=\"https://fodi.itch.io/arucontrol-construct3\">external</a> <a href=\"https://lasermagnet.itch.io/wordpile\">libraries</a>. I landed at Construct because I much prefer the event-based system compared to writing actual code. This hasn't changed a bit.</li>\n<li><strong>Steam integration</strong><br>I have no intention to release a game on Steam anytime soon.</li>\n<li><strong>Networked multiplayer</strong><br>I made a few one-screen local multiplayer games though.</li>\n</ul>\n<p> </p>\n<p>Hey, thanks for reading! Or scrolling all the way down :) I'll try my best to make an updated version of this next year. If you have any feedback, feel free to find and message me in the <a href=\"https://discord.gg/gZK4GndV\">Construct Community Discord</a>!</p>",
            "image": "https://advancedconstruct.net/media/posts/23/cookbook.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Productivity",
                   "Organization",
                   "Basics"
            ],
            "date_published": "2025-12-23T19:39:53+01:00",
            "date_modified": "2025-12-28T17:53:22+01:00"
        },
        {
            "id": "https://advancedconstruct.net/game-development-resources/",
            "url": "https://advancedconstruct.net/game-development-resources/",
            "title": "Links for game developers",
            "summary": "<p>A collection of links for practising and future game developers. Engines and art software, learning resources, assets, project management tools, services, et cetera.</p>\n",
            "content_html": "<p>A collection of links for practising and future game developers. Engines and art software, learning resources, assets, project management tools, services, et cetera.</p>\n\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#j-t-kmotorok\">Game engines</a>\n<ul>\n<li><a href=\"#kezd-kre-optimaliz-lt-cuccok\">Recommended for beginners</a></li>\n<li><a href=\"#a-nagy-nevek\">The big three</a></li>\n<li><a href=\"#m-g-n-h-ny-aj-nl-s\">A few more recommendations</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1imqelhma227\">Assets (2D / 3D graphics, sounds, music)</a></li>\n<li><a href=\"#mcetoc_1ilgrsioa1k\">Project management &amp; collaboration</a></li>\n<li><a href=\"#mcetoc_1imqelhma222\">Learning resources</a></li>\n</ul>\n</div>\n<h2 id=\"j-t-kmotorok\">Game engines</h2>\n<h3 id=\"kezd-kre-optimaliz-lt-cuccok\">Recommended for beginners</h3>\n<ul>\n<li><a href=\"https://www.construct.net\">Construct 3</a>: a freemium 2D engine with some 3D features, runs in the browser (and works offline too). It has a no-code event system, or you can develop in JavaScript or TypeScript. The free version is quite limited, but it's good for getting a general feel of the engine. The full version requires a subscription.</li>\n<li><a href=\"https://gdevelop.io\">GDevelop</a>: A free 2D / limited 3D engine that is fairly similar to Construct. It has some optional paid features.</li>\n<li><a href=\"https://gamemaker.io\">GameMaker</a>: this 2D engine has been along for a long time and it's free for non-commercial use. For commercial projects, you need to buy a very fairly priced license (one-time purchase).</li>\n<li><a href=\"https://microstudio.dev\">microStudio</a>: Open source 2D engine, has a browser based and downloadable version too. Supports many programming languages, including its own Lua-like microScript language, as well as Lua, Python, Javascript, and Typescript.</li>\n<li><a href=\"https://www.gbstudio.dev\">GB Studio</a>: open source development environment for making GameBoy or GameBoy Color games, that can run on real hardware, emulators or in the browser. It has a block based no-code programming interface.</li>\n<li><a href=\"https://ctjs.rocks\">Ct.js</a>: open source 2D engine and development environment. Has a block based no-code interface called Catnip, or you can use JavaScript to code your game.</li>\n<li><a href=\"https://twinery.org\">Twine</a>: open source engine for making interactive fiction games. Runs in the browser, requires no coding, but it can be extended with CSS and JavaScript.</li>\n<li><a href=\"https://bitsy.org\">Bitsy</a>: open source 2D no-code engine for making retro games.</li>\n<li><a href=\"https://whimtale.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Whimtale</a>: free 2D no-code engine inspired by Bitsy. It has browser based and downloadable versions as well.</li>\n<li><a href=\"https://rpginabox.com\">RPG in a Box</a>: very fairly priced 2D/3D engine and editor primarily for making RPG games. It has a no-code interface with optional scripting support with its own Bauxite language.</li>\n<li><a href=\"https://www.rpgmakerweb.com/\">RPG Maker</a> MZ / MV / VX / XP / etc: a family of 2D no-code engines for making RPGs. Requires a one time purchase, but most versions have 30 day free trials available.</li>\n<li><a href=\"https://store.steampowered.com/app/1066860/RPG_Paper_Maker/\" target=\"_blank\" rel=\"noopener noreferrer\">RPG Paper Maker</a>: open source 2.5D engine inspired by RPG Maker. Its free for non-commercial use, making commercial games requires a fairly priced lifetime license.</li>\n<li><a href=\"https://www.puzzlescript.net/index.html\">PuzzleScript</a>: open source brower based 2D engine and scripting language for primarily for making retro puzzle / action games.</li>\n<li><a href=\"https://www.adventuregamestudio.co.uk/\">Adventure Game Studio</a>: an open source game engine actively developed since 1997, primarily for making point-n-click adventure games.</li>\n</ul>\n<h3 id=\"a-nagy-nevek\">The big three</h3>\n<ul>\n<li><a href=\"https://godotengine.org\">Godot</a>: popular open source 2D/3D engine. Can be programmed via its own Python-like GDScript language, or C#.</li>\n<li><a href=\"https://unity.com\">Unity</a>: popular commercial 2D/3D engine, with a massive community and array of learning resources. Can be programmed via a node based no-code interface, or C#. It has a free version and multiple subscription based plans with advanced features.</li>\n<li><a href=\"https://www.unrealengine.com\">Unreal Engine</a>: free engine primarily for making 3D games. Can be programmed via Blueprint, a node based no-code interface, or C++.</li>\n</ul>\n<h3 id=\"m-g-n-h-ny-aj-nl-s\">A few more recommendations</h3>\n<ul>\n<li><a href=\"https://love2d.org\">LÖVE</a>: open source 2D engine based on the Lua language.</li>\n<li><a href=\"https://www.lexaloffle.com/pico-8.php\">PICO-8</a>: commercial (but very fairly priced) Lua based 2D engine and \"fantasy console\" for making retro games.</li>\n<li><a href=\"https://tic80.com\">TIC-80</a>: open source engine and \"fantasy console\", similar to PICO-8.</li>\n<li><a href=\"https://morgan3d.github.io/quadplay/\">quadplay✜</a>: open source engine and \"fantasy console\", which can be programmed using its own language called PyxlScript.</li>\n</ul>\n<h2 id=\"mcetoc_1imqelhma227\">Assets (2D / 3D graphics, sounds, music)</h2>\n<ul>\n<li><a href=\"https://itch.io/game-assets\">Itch.io</a>: an asset marketplace with tons of free and commercial 2D/3D art,  sound effects and music.</li>\n<li><a href=\"https://opengameart.org/\">OpenGameArt</a>: free and mostly permissively licensed asset repository.</li>\n<li><a href=\"https://kenney.nl/\">Kenney</a>, aka. <a href=\"https://www.assetjesus.com/\">Asset Jesus</a>: an incredible collection of hand made CC0 licensed 2D and 3D assets, music, sound effects.</li>\n<li><a href=\"https://quaternius.com/\">Quaternius</a>: CC0 licensed low poly 3D models.</li>\n<li><a href=\"https://poly.pizza/\">PolyPizza</a>: free and mostly permissively licensed 3D low poly asset repository.</li>\n<li><a href=\"https://www.sharetextures.com/\">Share Textures</a>: a collection of CC0 licensed textures.</li>\n<li><a href=\"https://polyhaven.com/\">Poly Haven</a> and <a href=\"https://ambientcg.com/\">ambientCG</a>: a collection of CC0 licensed 3D models and textures.</li>\n<li><a href=\"https://99sounds.org/sounds/\">99Sounds</a>: a collection of free to use sound effects.</li>\n<li><a href=\"https://lospec.com/\">Lospec</a>: a repository of pixel art palettes and tutorials.</li>\n<li><a href=\"https://incompetech.com/music/royalty-free/music.html\">Incompetech</a>: CC-BY licensed music by Kevin MacLeod.</li>\n<li><a href=\"https://freesound.org/\">Freesound</a>: free and mostly permissively licensed sound effect repository. Downloading requires a free account.</li>\n<li><a href=\"https://www.fontspace.com/\">FontSpace</a> and <a href=\"https://fonts.google.com/\">Google Fonts</a>: free and mostly permissively licensed fonts.</li>\n<li><a href=\"https://gwfh.mranftl.com/fonts\">Google Webfonts Helper</a>: alternative Google Fonts frontend for downloading fonts in specific formats (woff, woff2, ttf, otf, eot, svg).</li>\n<li><a href=\"https://pixabay.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Pixabay</a>: a repository of free nad permissively licensed 2D, 3D, vector graphics, sound and music assets.</li>\n<li><a href=\"https://game-icons.net/\">Game-icons.net</a>: a huge collection of two-color SVG icons available under CC-BY 3.0 license.</li>\n</ul>\n<h2 id=\"mcetoc_1ilgrsioa1k\">Project management &amp; collaboration</h2>\n<ul>\n<li><a href=\"https://trello.com/\">Trello</a>: kanban-style freemium project management tool.</li>\n<li><a href=\"https://miro.com/\">Miro</a>: \"infinite board\" type freemium collaboration tool.</li>\n<li><a href=\"https://www.notion.com\">Notion</a>: freemium tool for collaboration.</li>\n<li><a href=\"https://obsidian.md/\">Obsidian</a>, <a href=\"https://logseq.com/\">Logseq</a>: popular open source apps for knowledge bases, planning, note taking, documentation, et cetera.</li>\n</ul>\n<h2 id=\"mcetoc_1imqelhma222\">Learning resources</h2>\n<ul>\n<li><a href=\"https://www.redblobgames.com/\">Red Blob Games</a>: free interactive visual explanations of math, algorithms and game mechanics.</li>\n<li><a href=\"https://www.gameuidatabase.com/\">Game UI Database</a>: game UI reference for designers.</li>\n<li><a href=\"https://www.bscotch.net/podcast\">Coffee with Butterscotch</a>: a gamedev comedy podcast by Butterscotch Shenanigans, an indie game studio, equally hilarious and insightful.</li>\n<li><a href=\"https://saint11.art/blog/pixel-art-tutorials/\">Pixel Art Tutorials</a>: incredible animated pixel art tutorials by Pedro Medeiros (Saint11).</li>\n<li><a href=\"https://www.omnicalculator.com/math\">Omnicalculator</a>: learning resource and interactive calculators.</li>\n<li><a href=\"https://deepnight.net/games/game-feel/\">Game Feel Demo</a> by Deepnight Games: an interactive demonstration of a lot of ways to add \"juice\" to a game.</li>\n<li><a href=\"https://gameprogrammingpatterns.com/\">Game Programming Patterns</a> (Robert Nystrom): free resource on video game programming practices.</li>\n</ul>\n<p>If you like this list, be sure to check out a similar <a href=\"https://docs.google.com/document/d/1IinnBt7pj2dnydrdsHC_4t9p4tq4QIjkQ75HJot7gz0/\">collection by clovelt</a>, which also contains resources on business, marketing and publishing.</p>",
            "image": "https://advancedconstruct.net/media/posts/22/gamedev-links.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Links"
            ],
            "date_published": "2025-10-16T21:57:54+02:00",
            "date_modified": "2025-12-24T11:50:31+01:00"
        },
        {
            "id": "https://advancedconstruct.net/construct-resources/",
            "url": "https://advancedconstruct.net/construct-resources/",
            "title": "Links for Construct developers",
            "summary": "<p>If you're a Construct developer, check out these neat resources made by the community. Tutorials, tips, optimisation techniques, 3rd party tools, et cetera.</p>\n",
            "content_html": "<p>If you're a Construct developer, check out these neat resources made by the community. Tutorials, tips, optimisation techniques, 3rd party tools, et cetera.</p>\n\n<h2>Learning resources</h2>\n<ul>\n<li><a href=\"https://thinkery.co.uk/u/james/construct3\">Construct 3 tips, best practices &amp; notes by James</a></li>\n<li><a href=\"https://fed-4.gitbook.io/c3-cheat-sheets/\">Construct 3 cheat sheets by Federico Calchera</a></li>\n<li><a href=\"https://www.construct.net/en/tutorials/performance-tips-community-3247\">Performance tips by Federico Calchera</a></li>\n<li><a href=\"https://howtoconstructdemos.com/\">HowToConstruct.com templates &amp; demos</a></li>\n<li><a href=\"https://www.construct.net/en/users/198994/skymen/tutorials\">Construct 3 tutorials by Skymen</a></li>\n<li><a href=\"https://www.youtube.com/@XanderwoodGameDev\">Construct 3 video tutorials by Xanderwood</a></li>\n<li><a href=\"https://www.youtube.com/@gamedesignwithreilly\">GameDesign With Reilly (video tutiorials)</a></li>\n<li><a href=\"https://www.youtube.com/@FoozleCC/videos\">Construct 3 tutorials and showcase videos by Foozle</a></li>\n</ul>\n<h2>Tools</h2>\n<ul>\n<li><a href=\"https://github.com/skymen/construct-crawler\">Construct Crawler by Skymen</a>: cross platform app for manipulating Construct projects</li>\n<li><a href=\"https://pipelab.app/\">Pipelab by Armaldio</a>: freemium cross platform app for automating deployment of Construct projects</li>\n<li><a href=\"https://github.com/fodi/c3p2git/\">c3p2git by Fodi</a>: Windows CLI utility for turning c3p project files into Git commits</li>\n<li>Sprite font generators\n<ul>\n<li><a href=\"https://stmn.itch.io/font2bitmap\">Font To Bitmap by stmn</a> (browser based)</li>\n<li><a href=\"https://spritetype.netlify.app/\">SpriteType by Dokse</a> (browser based)</li>\n<li><a href=\"https://www.construct.net/en/forum/game-development/tools-and-resources-27/sprite-font-generator-v3-64038\">Sprite Font Generator by blackhornet</a> (Windows app)<a href=\"https://easings.net/\"></a></li>\n</ul>\n</li>\n<li><a href=\"https://fodi.github.io/construct-3-projects/ConstructColorConverter/\">Construct Color Converter by Fodi</a>: batch convert hexadecimal RGB palettes into Construct 3 color values &amp; global constant declarations</li>\n<li><a href=\"https://store.pixelperfectstudio.mx/shop/\">Construct 3 addons by Pixel Perfect Studios</a></li>\n<li><a href=\"https://skymen.github.io/construct-shader-graph/\">Construct Shader Graph by Skymen</a>: a node based visual shader editor with WebGL 1, WebGL 2 and WebGPU support.</li>\n<li><a href=\"https://gwfh.mranftl.com/fonts\">Google Webfonts Helper</a>: for downloading free font files from Google Fonts in any format (including TTF)</li>\n<li><a href=\"https://comigo.itch.io/placeholder-gen\">CoMiGo's Placeholder Generator</a>: a simple, free and engine-agnostic placeholder sprite generator, great for grayboxing.</li>\n<li><a href=\"https://github.com/bryc/code/blob/master/jshash/PRNGs.md\">Javascript PRNGs</a>: public domain code for various seed generators, seeded PRNGs and hashing functions. Can be useful for making games with procedurally generated content.</li>\n</ul>\n<h2>Services</h2>\n<ul>\n<li>Free(mium) webhosting services for HTML5 builds:<br><a href=\"https://itch.io/\">Itch.io</a>, <a href=\"https://gamejolt.com/\">GameJolt</a>, <a href=\"https://docs.github.com/en/pages\" style=\"font-size: inherit;\">GitHub Pages</a>, <a href=\"https://docs.gitlab.com/user/project/pages/\" style=\"font-size: inherit;\">GitLab Pages</a>, <a href=\"https://pages.cloudflare.com/\" style=\"font-size: inherit;\">Cloudflare Pages</a>, <a href=\"https://vercel.com/\" style=\"font-size: inherit;\">Vercel</a>, <a href=\"https://www.netlify.com/\">Netlify</a>, <a href=\"https://surge.sh/\">Surge</a></li>\n<li>Game porting services:<br><a href=\"https://mp2.dk/\">MP2 Games</a>, <a href=\"https://ratalaikagames.com/\">Ratalaika Games</a>, <a href=\"https://www.seaven-studio.com/\">Seaven Studio</a></li>\n</ul>",
            "image": "https://advancedconstruct.net/media/posts/21/construct-links.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Links"
            ],
            "date_published": "2025-10-12T22:38:06+02:00",
            "date_modified": "2025-12-28T17:56:13+01:00"
        },
        {
            "id": "https://advancedconstruct.net/sheet-management/",
            "url": "https://advancedconstruct.net/sheet-management/",
            "title": "Sheet management",
            "summary": "<p class=\"msg msg--highlight \">An article on function sheets, action sheets, value sheets, top level sheets... oh, and event sheets of course. And emojis.</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">An article on function sheets, action sheets, value sheets, top level sheets... oh, and event sheets of course. And emojis.</p>\n\n<p>What is an event sheet? A sheet that contains events, right? But what if there is a sheet that only has global variables or constants? Or one containing functions exclusively? Or custom actions, for that matter.</p>\n<p>In the last few years I've been using a system that involves having top level event sheets and four subfolders, one for sheets with custom actions, one for sheets with functions, one for sheets with global values (variables and constants) and one for actual event sheets. The subfolders are named <strong>Actions</strong>, <strong>Events</strong>, <strong>Functions </strong>and <strong>Values</strong>, all sheets in the subfolders are prefixed with the letters \"a\", \"e\", \"f\" and \"v\" respectively, so it's easier to navigate the open tabs.</p>\n<p>In this article I go through the details of this setup (with some sidenotes here and there). I have a <a href=\"https://github.com/fodi/construct-3-projects/raw/refs/heads/main/projectfiles/BlankTemplate.c3p\">blank project template that you can download</a> with the folders and most commonly used event sheets (most of them are empty, prefixed with an underscore).</p>\n<p>A slightly weird thing I also like to do is to add emojis at the end of event sheet names. They act a bit like icons, so when I have a lot of tabs open, it's easier for me to find the one I'm looking for. Emojis also signify the fact that the tab is an event sheet, and not a layout.</p>\n<p class=\"msg msg--info\"><strong>Sidenote</strong><br>If you put emojis in the names of Construct 3 event sheets (or other primitives, eg. objects) and save your project as a folder instead of a <code>c3p</code> file, make sure that your file system and apps that handle your project folders are okay with emojis in the file names. For example, Dropbox isn't  - at the time of writing, it refuses to sync files with emojis in their names. Using <code>c3p</code> project files inside a Dropbox folder is a workaround for this issue, since those are really <code>zip</code> files, which handle emoji filenames in them without problems.</p>\n<p>Okay, let's dive in!</p>\n<h2>Top level sheets</h2>\n<p>My rule is to only have sheets on the top level if they are assigned to at least one layout. When I'm prototyping, I usually start dumping everything in a top level event sheet, then organize it later by moving everything to other sheets. I like to go fast and do periodic clean-ups after things are in a working state.</p>\n<p>For simpler layouts (eg. the crappy low effort menus that I usually make for jam games and prototypes), I just put all events in a top level sheet, since there aren't too many anyway.</p>\n<p>For complex ones (like levels) I create a top level event sheet (eg. <code>Level 🗺️</code>) and only put event sheet includes in it, nothing else. There's no need to include sheets that only contain functions, global variables, constants or custom actions, as those are all globally available by default. <span style=\"text-decoration: underline;\">Actual</span> event sheets do have to be included in top level event sheets in order to run.</p>\n<h2>Actions folder</h2>\n<p>This folder is for sheets with custom actions only, one sheet per object type (or family). The sheet's names match the object or family name, prefixed with the letter \"a\" (short for \"action\") and suffixed with an emoji, eg. <code>aPlayer 🧑</code>, <code>aEnemy 👾</code>, etc.</p>\n<p>Common custom actions include <code>spawn</code> (which spawns an instance of its object type or family) and <code>tick</code> (which is called in an every tick event and does various things with the instance). If a game has players and/or enemies with health, I usually have one called <code>changeHealth</code> on the object type which is called when an instance is damaged or healed. This action takes care of changing the health instance variable, doing audio and visual feedback based on the change, checking if health is zero and doing the destruction of the instance, if needed.</p>\n<h2>Events folder</h2>\n<p>This folder is for <span style=\"text-decoration: underline;\">actual</span> event sheets, only containing events (sometimes enclosed in groups). These sheets have to be included in at least one top level event sheet in order to work (unlike <strong>function</strong>, <strong>action</strong> and <strong>value</strong> sheets). I never put any global variables, constants, custom actions or functions in these sheets.</p>\n<p>Sheets in this folder are named according to the kind of conditions (mostly triggers) that are in them. Here are the ones I use most frequently:</p>\n<ul>\n<li><code>eCollisions 💥</code> for \"On collision with another object\" events only. I used to put overlap checks in here too, but nowadays I usually do those inside <code>tick</code> custom actions instead (and other non-trigger events too). I find it very handy to have all collision checks in a single sheet.</li>\n</ul>\n<p class=\"msg msg--info\"><strong>Sidenote<br></strong>When setting up collision checks, I try to set the first object to the one that (probably) has fewer instances in a layout, and the second to the one that (probably) has more. I read somewhere that this has better performance. Also don't forget to set a reasonable collision cell size for your layout, the default is usually way too big.</p>\n<ul>\n<li><code>eCreated ✨</code> for \"On created\" events only, and only for object types / families that have instances on a layout at start, not ones that are dynamically spawned during runtime. In the former case, I usually make an <code>init</code> custom action which initializes the object and call it from the \"On created\" event.<br>If an object type only spawns dynamically during runtime, I usually have a <code>spawn</code> custom action for it, which takes care of the spawning and any initialization as well. I keep at least one instance of dynamically spawned objects is in a \"repository layout\" - nowadays I name it <code>@ Templates</code>. Most official examples have one called <code>ObjectRespository</code>.</li>\n<li><code>eTimers ⏰</code> for \"On timer\" events only.</li>\n</ul>\n<p class=\"msg msg--info\"><strong>Sidenote<br></strong>Don't forget to add a \"for each\" to \"On timer\" events if there's a chance that multiple instances of the same object might finish their timer in the same tick. If that happens and there's no \"for each\", only one instance will be picked by the \"On timer\" trigger, which is a bit of a footgun, if you ask me (by the way I'm also planning an article on Construct 3 footguns). That said, there's a <a href=\"each\" target=\"_blank\" rel=\"noopener noreferrer\">warning in the official docs</a> about this behaviour.</p>\n<ul>\n<li><code>eTweens 🌓</code> for the Tween behaviour's \"On finished\" events only. As far as I know, there's no need to \"for each\" those like Timers.</li>\n<li><code>eInput_Global 🔘</code> and <code>eInput_Level 🕹️</code> for anything that is input related: keyboard, mouse, touch and game pad events including triggers and non-triggers (eg. \"is down\"). <code>eInput_Global 🔘</code> contains input events which have to run on multiple or all layouts (eg. toggling full screen or restarting the whole game, etc). This also means that it's included in multiple top level event sheets. <code>eInput_Level 🕹️</code> only has input handling related to the level and I usually have events split into multiple groups: one for player movement (or one for each player in a local multiplayer game), one for UI, one for developer cheats and so on.</li>\n<li><code>eSystem ⏱️</code> exclusively for events of the \"System\" category. Usually it contains a single \"On start of layout\" event and a single \"Every tick\" event with multiple function and custom action calls. Any other triggers from the \"System\" category also go in this sheet, eg. \"On signal\", \"On canvas snapshot, \"On save complete\", etc.</li>\n</ul>\n<p>Here are some less frequently used ones:</p>\n<ul>\n<li><code>eAJAX 📡</code> for trigger events of the AJAX object, like \"On completed\" and \"On error\".</li>\n<li><code>eAnimations 🎞️</code> for animation related trigger events, like \"On finished\" and \"On frame changed\".</li>\n<li><code>eMovement 🏃</code> for movement behaviour related triggers, like \"On landed\" for the Platform behaviour, \"On step\" for the Bullet behaviour, \"On target acquired\" for the Turret behaviour, et cetera.</li>\n</ul>\n<h2>Functions folder</h2>\n<p>This is for sheets containing functions only.</p>\n<p>There's usually one called <code>fUtilities 🧰</code>, which contains a handful of frequently used math functions which calculate and return values like <code>volumePercentToDb</code> (for converting a 0-100 percent value to decibels for Audio object actions), <code>distance3D</code> (like the system expression <code>distance</code> but for 3D coordinates), <code>expDecay</code> (the function I usually use <a href=\"https://www.youtube.com/watch?v=LSNQuFEDOyQ\" target=\"_blank\" rel=\"noopener noreferrer\">instead of</a> <code>lerp</code>).<br>I frequently have some helper functions like <code>toggleFullscreen</code> which requests or cancels full screen mode and <code>toggleLayer</code> which simultaneously toggles the visibility and interactivity of a given layer.</p>\n<p>In almost all projects I have a sheet called <code>fLevel 🎬</code>, which contains \"game life cycle\" functions like <code>initLevel</code>, <code>endGame</code> and other game-specific functions that do a lot of things with a lot of objects.</p>\n<p>In some projects I used to have a sheet called <code>fAudio 🎵</code> for functions like <code>playSFX</code> and <code>playBGM</code> to play sound and music according to the current volume settings, with optional debouncing and random variations for sound effects. Nowadays I create an <code>aAudio 🎵</code> sheet in the Actions folder and put similarly named custom actions on the Audio object.</p>\n<p class=\"msg msg--info\"><strong>Sidenote</strong><br><a href=\"https://github.com/fodi/construct-3-projects/raw/refs/heads/main/projectfiles/BlankTemplate.c3p\">My blank project template</a> also includes the <code>fRules 📜</code> sheet, with a very specific set of functions, for loading a default rule set for the game from a JSON file and allowing URL parameter based rule overrides to help with balancing / testing. It's a whole thing, I'll probably write an article about it at one point.</p>\n<h2>Values folder</h2>\n<p>The <code>Values</code> folder is for sheets containing only global variables or constants. I have a fixed set of 4 sheets in this folder:</p>\n<ol>\n<li><code>vPrimitives 🍞</code> containing global constants for a handful of \"generic\" values and characters that I use frequently in expressions:\n<ul>\n<li><code style=\"font-weight: var(--font-weight-normal);\">NOTHING</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> with the numeric value of </span><code style=\"font-weight: var(--font-weight-normal);\">-1</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">, which is the next best thing to null (which is not a thing in Construct). Eg. if I have an instance variable for storing object UIDs, I use this to \"clear\" its value (or to check if it's set or not), since <code>-1</code> not a valid UID. Some system expressions </span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">also return </span><code style=\"font-weight: var(--font-weight-normal);\">-1</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> (eg. <code>find</code> when there are no results), so it comes handy for those too.</span></li>\n<li><code>NO</code> and <code>YES</code>: with the numeric values <code>0</code> and <code>1</code> respectively. I almost never use booleans in my projects, instead I use numbers with these values. My main beef with booleans in Construct 3 is that I can't pass a dynamic value to a function or custom action with a boolean parameter. When calling one, I have to use a checkbox to either pass true or false, I cannot pass the result of an expression or a variable. Because of this I refrain from using boolean variables in functions and custom actions, and use the numbers 0 and 1 instead.</li>\n<li><code>EMPTY</code>, which is an empty string, the <code>NOTHING</code> of string variables. I use it to clear a string variable or to check if it's empty.</li>\n<li><code>COMMA</code>, <code>UNDERSCORE</code>, <code>SPACE</code> and <code>DOT</code>: single character string constants that contain a comma, an underscore, a space and a dot (or full stop, period, etc) respectively. I use <code>DOT</code> when writing JSON object path expressions, the rest are for dealing with comma / underscore / space delimited strings (aka. \"cheapskate arrays\"), eg. with <code>tokenat</code> and <code>tokencount</code>.</li>\n</ul>\n</li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">vNames 🗃️</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> contains global constants that act as \"enums\" or \"macros\" (not sure of the right terminology). I have a whole </span><a href=\"https://advancedconstruct.net/using-global-names/\" style=\"font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">article on \"global names\"</a><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> that goes into details on what is in this sheet.</span></li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">vConfig 💎</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> contains global constants prefixed with <code>C_</code>, which are all magic numbers or magic strings that do not need to change during runtime. The contents of this sheet are specific to the project, but here are some real-life examples from our game </span><a href=\"https://lasermagnet.itch.io/wordpile\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Wordpile</a><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">:</span>\n<ul>\n<li><code style=\"font-weight: var(--font-weight-normal);\">C_Tile_TweenOut_Time</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: tween time for fading out a Tile object.</span></li>\n<li><code>C_DIR_Layouts</code>: path of the folder that contains level layouts (which are loaded via AJAX).</li>\n<li><code>C_UI_Hold_Interval</code>: the amount of time a player needs to hold a button to activate its secondary function.</li>\n<li><code>C_Color_Red</code>: a certain red color value (in this case <code>-281479422673919</code>) that I use in a some \"set color\" actions.</li>\n<li><code>C_Player_Count_Max</code>: hard limit of players that can join a local multiplayer match (the game supports 1-4 players).</li>\n</ul>\n</li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">vState ♻️</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> only contains global variables (and no constants) that hold internal state of the game. These are camel cased by default, but sometimes I group them with prefixes and use an underscore after a prefix. Some random examples:</span>\n<ul>\n<li><code>locale</code>: contains 2 character code for the currently selected UI language (eg. \"en\"), used for configuring the Internationalization plugin after the a language is chosen on the UI.</li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">volumePercentBGM</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> and </span><code style=\"font-weight: var(--font-weight-normal);\">volumePercentSFX</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: 0-100 values of the background music and sound effects.</span></li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">level_seed</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: current seed of the level used for initializing the AdvancedRandom object.</span></li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">level_currentPlayerId</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: contains which player's turn is it in a multiplayer game (0 for first player, 1 for second, etc).</span></li>\n<li><code style=\"font-weight: var(--font-weight-normal);\">level_penaltyTotal</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">: when the level ends, the player gets an amount of penalty points based on how they did and it gets tallied up in this variable.</span></li>\n</ul>\n</li>\n</ol>\n<p>That's about it, really. The system hasn't changed much recently, but sometimes I do decide to rename or restructure a few things. I'll try to keep this article updated if that happens.</p>",
            "image": "https://advancedconstruct.net/media/posts/20/event-sheets.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Organization"
            ],
            "date_published": "2025-09-16T19:06:36+02:00",
            "date_modified": "2025-10-04T23:56:02+02:00"
        },
        {
            "id": "https://advancedconstruct.net/downloadable-projects/",
            "url": "https://advancedconstruct.net/downloadable-projects/",
            "title": "Downloadable projects",
            "summary": "<p>I have some free template &amp; example projects, all available under the MIT license.</p>\n",
            "content_html": "<p>I have some free template &amp; example projects, all available under the MIT license.</p>\n\n<p>You can find a list of projects and demos here:<br><a href=\"https://fodi.github.io/construct-3-projects/\">https://fodi.github.io/construct-3-projects</a></p>\n<p>You can grab the source files from this monorepo:<br><a href=\"https://github.com/fodi/construct-3-projects\">https://github.com/fodi/construct-3-projects</a></p>\n<p>I also have some example &amp; experimental projects hosted on Itch.io, you can find them in this collection:<br><a href=\"https://itch.io/c/6291129/fodis-open-source-projects\">https://itch.io/c/6291129/fodis-open-source-projects</a></p>\n<p>Have fun!</p>\n<p>If you find any of them useful, and would like to <a href=\"https://buymeacoffee.com/fodi\" target=\"_blank\" rel=\"noopener noreferrer\">buy me a coffee</a>, you can :)</p>",
            "image": "https://advancedconstruct.net/media/posts/18/downloadable-projects.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
            ],
            "date_published": "2025-09-01T21:29:50+02:00",
            "date_modified": "2025-12-27T19:36:44+01:00"
        },
        {
            "id": "https://advancedconstruct.net/using-global-names/",
            "url": "https://advancedconstruct.net/using-global-names/",
            "title": "Using &quot;global names&quot;",
            "summary": "<p class=\"msg msg--highlight \">String literals? Yuck. More typo protection, better autocompletes, enhanced usage lookups? Yes please!</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">String literals? Yuck. More typo protection, better autocompletes, enhanced usage lookups? Yes please!</p>\n\n<p>OG Construct developer <a href=\"https://bsky.app/profile/salmanshh.bsky.social\">Salman Shurie</a> referred to the engine's event system as \"super intellisense\" a couple of times - turns out the phrase was coined by <a href=\"https://bsky.app/profile/wtfmig.bsky.social\">@wtfmig</a>. Nevertheless, I think it's on point.</p>\n<p>When you're using the event system (and no JS/TS code), you can't mistype names of variables, constants, behaviours, objects, families or functions, because the editor simply won't let you. You can also rename any of these without worrying about breaking code, Construct automatically updates all references to reflect the name change (again, as long as they are not mentioned in JS/TS code). If you're using the paid version, the editor can also find all usages of variables, constants, objects and family members. It's an amazing tool and I use it countless times during development.</p>\n<p>There are some things you can still mistype, since they are not structured as identifiers, but strings. Layer names, animation names, effect names, various tags (for tweens, timers, sounds, et cetera) can be entered as string literals. Construct tries to suggest them, but you can still make a typo and you don't get usage finding. And if you decide to rename a layer, animation, effect or any sort of tag, you'll have to manually search for it and change it manually by hand which is tedious and error prone.</p>\n<p>Rather than doing that, you can create global constants (which are identifiers) and use them instead of string literals. This way you get typo protection, usage lookups and renaming things is a lot easier once you resist the urge to use string literals in those cases. Granted, there's an extra step (creating a global constant), but I think it's worth the effort.</p>\n<p>In my projects I put all \"global name\" constants in an event sheet called <code>vNames</code>. Since it only contains global constants, it's automatically \"included\" in all events sheets, so you don't have to worry about importing it. (the same goes for functions and custom actions too; only sheets containing events have to be included to run.)</p>\n<p>You can also apply a naming convention on the global \"name\" constants to signify their \"type\", eg:</p>\n<ul>\n<li><code>LAYER_Main = \"Main\"</code> (value matches the layer name)</li>\n<li><code>TIMER_Invincibility = \"Invincibility\"</code> (timer tag)</li>\n<li><code>TWEEN_FadeIn = \"FadeIn\"</code> (tween tag)</li>\n<li><code>EFFECT_Brightness = \"Brightness\"</code> (value matches an effect name)</li>\n<li><code>ANIM_Idle = \"Idle\"</code> (value matches an animation name)</li>\n</ul>\n<p>...or you can even add the names of the related family or object type, so there's no reuse between different types:</p>\n<ul>\n<li><code>TIMER_Player_Invincibility = \"Invincibility\"</code></li>\n<li><code>TWEEN_Enemy_Opacity_FadeIn = \"Opacity_FadeIn\"</code> (also includes the \"type\" of tween - in this case, opacity)</li>\n<li><code>EFFECT_Item_Brightness = \"Brightness\"</code></li>\n<li><code>ANIM_Enemy_Idle = \"Idle\"</code> (matches an animation name in the</li>\n<li><code>ANIM_Player_Idle = \"Idle\"</code></li>\n</ul>\n<p>Lately I've been doing the latter which has two additional benefits:</p>\n<ul>\n<li>Less confusion when finding references, since every name is specific to an object type or a family</li>\n<li>Less typing / better autocompletion: eg. I can type ANIM_ to get a list of all animation names, continuing typing the object/family name filters the list even further so it's easy to choose one with the arrow keys</li>\n<li>Tidier vNames sheet: alphabetically sorting global names means they are grouped by type and object / family.</li>\n</ul>",
            "image": "https://advancedconstruct.net/media/posts/14/global-names-2.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Organization"
            ],
            "date_published": "2025-08-13T21:56:00+02:00",
            "date_modified": "2025-12-22T16:04:11+01:00"
        },
        {
            "id": "https://advancedconstruct.net/project-organization/",
            "url": "https://advancedconstruct.net/project-organization/",
            "title": "Project organization",
            "summary": "<p>I'd like to cover many things on this topic, so here's a list showing which article's available and what's planned.</p>\n",
            "content_html": "<p>I'd like to cover many things on this topic, so here's a list showing which article's available and what's planned.</p>\n\n<h2>Available</h2>\n<ul>\n<li><strong><a href=\"https://advancedconstruct.net/using-global-names/\">Using \"global names\"</a></strong><br>Construct does not have enums and uses string literals in some places where an enum would be more convenient. Here's a way to get almost all benefits of enums.</li>\n<li><strong><a href=\"https://advancedconstruct.net/sheet-management/\">Sheet management</a></strong><br>A system composed of top level or \"main\" sheets, action sheets, function sheets, value sheets and <span style=\"text-decoration: underline;\">actual</span> event sheets.</li>\n</ul>\n<h2>Planned</h2>\n<ul>\n<li><strong>Object &amp; family conventions</strong><br>Naming and grouping, typical hierarchies, instance variable and custom action usage</li>\n<li><strong>Global object(s)</strong><br>Also known as the level or game manager object, a singleton, or autoload in Godot-land. I use it to keep state between layouts, run timers and value tweens not related to objects and a few other minor things.</li>\n<li><strong>Code reuse and structuring</strong><br>How and when I use functions, custom actions and event groups.</li>\n</ul>\n<p> </p>",
            "image": "https://advancedconstruct.net/media/posts/17/project-organization.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Organization"
            ],
            "date_published": "2025-08-13T21:20:00+02:00",
            "date_modified": "2025-09-26T15:22:28+02:00"
        },
        {
            "id": "https://advancedconstruct.net/finding-things-in-construct/",
            "url": "https://advancedconstruct.net/finding-things-in-construct/",
            "title": "Finding things in Construct",
            "summary": "<p class=\"msg msg--highlight \">Let's take a look at the tools in Construct that let you find stuff.</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">Let's take a look at the tools in Construct that let you find stuff.</p>\n\n<p>Like in most development environments you can <strong>perform a text search</strong> by pressing <em>Ctrl</em> + <em>F</em>. Construct allows you to specify the scope of your search, toggle case sensitivity and you can even perform a second search to further filter down search results, which is especially handy when you have a lot of them. You can also <strong>remove results</strong> by selecting them and pressing <em>Delete</em> (re-running the search will bring them back).</p>\n<p>If you're editing a code block or a text file, <em>Ctrl</em> + <em>F</em> brings up a different toolbar that allows you to <strong>find (and even replace) text</strong>. The toolbar might look familiar if you're a VSCode user, since both are powered by the open source Monaco code editor which replaced the old CodeMirror 5 based one in Construct 3 r432. It also has nifty features like renaming identifiers by pressing <em>F2</em> and a bunch of other which you can find in the Command palette. Just note that the scope is always the current code block or tab.</p>\n<p>As your project grows, you might end up scrolling a lot up and down the project bar to <strong>find event sheets, objects, files</strong>, et cetera; luckily there's a search field you can focus by pressing <em>Ctrl</em> + <em>Shift</em> + <em>F</em> and just start typing to find matches.</p>\n<p>Since Construct is running in the browser you can still use the generic find tool, which can be especially useful for <strong>highlighting text on your screen</strong>. Press <em>Ctrl</em> + <em>G</em> to bring it up (since <em>Ctrl</em> + <em>F</em> is overridden to use Construct's own find feature).</p>\n<p>A super useful feature (unfortunately missing from the free version) is that you can right click any object, family, function, custom action or variable and select \"<strong>find all references</strong>\". In all cases, Construct will compile a list of each \"mention\" in the event sheets. If you selected an object instance, object type or family, you'll also see the number of instances per layout. If you use the \"Create object (by name)\" system action anywhere, object &amp; family reference lists will also include those actions as well just to be on the safe side; you can hide those results by unchecking \"Show ambiguous\".</p>\n<p>If you opt in to use <strong>\"global names\"</strong> instead of string literals to reference names of animations, layers, effects, various tags and such in your event sheets, you'll also be able to find all mentions of those using the \"find all references\" feature. Not to mention the added bonus of typo protection and easy renaming. <a href=\"#non-existing-post-with-id-7\">Read more about \"global names\" here!</a></p>\n<p>When making changes to a fairly complex project it's easy to get lost jumping between event sheets (especially if you have about 20 of them open). In such a scenario I like to use the often forgotten <strong>bookmarks feature</strong>. The <strong>Bookmarks bar</strong> is not open by default, but I usually have it open all the time docked in the bottom left corner, just taking a bit of space from the <strong>Properties bar</strong>. When you're in an event, you can press <em>F2</em> to bookmark it, which adds an easy to spot icon next to the event and adds it to the Bookmarks bar, where you can double click it to jump right to it. Just don't forget to remove old bookmarks you no longer need: the easiest way is to right-click the bar and select <strong>Remove All</strong>.</p>",
            "image": "https://advancedconstruct.net/media/posts/13/finding-things.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Productivity"
            ],
            "date_published": "2025-08-13T20:38:00+02:00",
            "date_modified": "2025-09-21T11:00:04+02:00"
        },
        {
            "id": "https://advancedconstruct.net/keyboard-mastery/",
            "url": "https://advancedconstruct.net/keyboard-mastery/",
            "title": "Keyboard mastery",
            "summary": "<p class=\"msg msg--highlight \">Switching between the mouse and keyboard can slow you down when you're working in event sheets. But keyboard shortcuts save the day!</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">Switching between the mouse and keyboard can slow you down when you're working in event sheets. But keyboard shortcuts save the day!</p>\n\n<p>One of the best ways to increase your productivity in any software is to learn keyboard navigation and shortcuts. Construct has very good \"keyboard coverage\", especially in event sheets.</p>\n<p>I find that switching between keyboard and mouse slows me down and doesn't help with my flow either, so I re-read the list of keyboard shortcuts in the official docs from time to time and try incorporating more of them in my workflow.</p>\n<p>You can <a href=\"https://www.construct.net/en/make-games/manuals/construct-3/interface/keyboard-shortcuts\">check out the list of Construct's keyboard shortcuts here</a>, and you might want to bookmark it too while you're there. I highly recommend starting with the shortcuts for the event sheet view, but if you spend a lot of time in the animation editor, those shortcuts come super handy as well.</p>\n<p>Moving the cursor (or selection) via keyboard in event sheets might be a bit awkward at first, but I think it's worth the effort to learn it.</p>\n<p>More seasoned developers probably know most cursor navigation shortcuts too, but just in case, here's a little refresher. (Note that these are for Windows, they probably work on Linux, possibly on macOS with some modifications.)</p>\n<ul>\n<li><em>Home</em> / <em>End</em> moves the cursor to the start or end of the line</li>\n<li><em>Ctrl</em> + <em>Home</em> / <em>End</em> to move to the start or end of the document</li>\n<li><em>Page up</em> / <em>Page down</em> does what it says on the tin :)</li>\n<li><em>Ctrl</em> + <em>Left</em> / <em>Right</em> arrow keys move the cursor by one word. What constitutes a word might vary based on the app or your OS; spaces and special characters are word delimiters most of the time with some exceptions (eg. underscore usually is not, hyphen-minus-dash depends).</li>\n</ul>\n<p>All of the above can be combined with <em>Shift</em> to select text.</p>\n<p>Since Construct is running in a browser, it's worth learning some of those shortcuts (these might depend on your browser or OS as well), especially:</p>\n<ul>\n<li><em>Ctrl</em> + <em>R</em> to reload; add Shift to force your browser to ignore the local cache</li>\n<li><em>Ctrl</em> + <em>W</em> to close a tab (including Construct, careful :), add <em>Shift</em> to close all tabs in the current window</li>\n<li><em>Ctrl</em> + <em>Shift</em> + <em>I</em> to open developer tools</li>\n</ul>",
            "image": "https://advancedconstruct.net/media/posts/12/mouse-slow.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Productivity"
            ],
            "date_published": "2025-08-13T20:10:00+02:00",
            "date_modified": "2025-09-21T11:00:33+02:00"
        },
        {
            "id": "https://advancedconstruct.net/backing-up-construct-projects/",
            "url": "https://advancedconstruct.net/backing-up-construct-projects/",
            "title": "Backing up Construct projects",
            "summary": "<p class=\"msg msg--highlight \">Backups are crucial if you don't want to have a bad time. And don't just use one! Here's how I do it.</p>\n",
            "content_html": "<p class=\"msg msg--highlight \">Backups are crucial if you don't want to have a bad time. And don't just use one! Here's how I do it.</p>\n\n<p>Data loss sucks and will happen to everyone, so back up your stuff and not only in one place. Consider hot &amp; cold backups, automatic and manual ones, and periodically verifying backups, especially for important stuff.</p>\n<p>My method is to put all of my <strong>Construct projects inside Dropbox</strong>, and since I'm almost always online that's already a form of automatic backup, since Dropbox detects when I save a project, immediately pushes the change to the server (and keeps a few versions back as well). Because Dropbox historically didn't support emojis in file names (and I like to use them in event sheet names), I opted to use c3p project files instead of project folders. At some point in 2025 Dropbox added the feature (at least on Windows, no idea if it works on any other OS), but so far I kept the practice. A disadvantage is that saving is a bit slower due to the extra zipping step, but my projects are usually not too big, so that's not a big issue for me.</p>\n<p>Every few hours I <strong>save the project with a new file name</strong> (eg. <code>MyProject-v01.c3p</code>, then <code>MyProject-v02.c3p</code>, etc), which also constitutes a form of versioning. If you prefer working with project folders, git is probably the best idea; just don't forget to commit and push to remote (eg. GitHub, GitLab, whatever floats your boat) regularly.</p>\n<p>I also use <strong>GitHub for manual backups</strong> by converting my c3p files into git commits with <a href=\"https://github.com/fodi/c3p2git\">this script</a> and pushing them to remote every once in a while (note that I'm only doing hobby stuff). Since I use 3 PCs for work (one of the reasons I went with Dropbox) they also act as offline snapshots; in case something goes terribly wrong with the contents of my Dropbox, I can boot one of the PCs disconnected form the Internet and make a backup of the (hopefully valid) state of my Dropbox.</p>\n<p><strong>Construct has an automatic backup feature</strong> and you should use it. You can set it up with a cloud provider or just a local folder. I do the latter one, but the folder is inside my Dropbox too. I can't vouch for other sync providers, but there's a good chance Google Drive, OneDrive, Mega and Syncthing are viable options.</p>",
            "image": "https://advancedconstruct.net/media/posts/11/backup.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Basics"
            ],
            "date_published": "2025-08-13T19:56:00+02:00",
            "date_modified": "2025-12-23T17:43:02+01:00"
        }
    ]
}
