{
    "version": "https://jsonfeed.org/version/1",
    "title": "Advanced Construct",
    "description": "",
    "home_page_url": "https://ac.gamedev.kitchen",
    "feed_url": "https://ac.gamedev.kitchen/feed.json",
    "user_comment": "",
    "author": {
        "name": "Fodi"
    },
    "items": [
        {
            "id": "https://ac.gamedev.kitchen/backing-up-construct-projects/",
            "url": "https://ac.gamedev.kitchen/backing-up-construct-projects/",
            "title": "Backing up Construct projects",
            "summary": "Data loss sucks and will happen to everyone, so back up your&hellip;",
            "content_html": "<p>Data loss sucks and will happen to everyone, so back up your stuff and not only in one place. Consider hot &amp; cold backups, automatic and manual ones, and periodically verifying backups, especially for important stuff.</p><p>My method is to put all of my <strong>Construct projects inside Dropbox</strong>, and since I’m almost always online that’s already a form of automatic backup, since Dropbox detects when I save a project, immediately pushes the change to the server (and keeps a few versions back as well). I use c3p project files (because I like to put emojis in my event sheet names - don’t judge :D - and those don’t sync at time of writing). A disadvantage is that saving is a bit slower due to the extra zipping step, but my projects are usually not too big, so that’s not a big issue for me.</p><p>Every few hours I <strong>save the project with a new file name</strong> (eg MyProject-v01, then MyProject-v02, etc), which also constitutes a form of versioning. If you prefer working with project folders, git is probably the best idea; just don’t forget to commit and push to remote (eg. GitHub, GitLab, whatever floats your boat) regularly.</p><p>I also use <strong>GitHub for manual backups</strong> by converting my c3p files into git commits with <a href=\"https://github.com/fodi/c3p2git\">this script</a> and pushing them to remote every once in a while (note that I’m only doing hobby stuff). Since I use 3 PCs for work (one of the reasons I went with Dropbox) they also act as offline snapshots; in case something goes terribly wrong with the contents of my Dropbox, I can boot one of the PCs disconnected form the Internet and make a backup of the (hopefully valid) state of my Dropbox.</p><p><strong>Construct has an automatic backup feature</strong> and you should use it. You can set it up with a cloud provider or just a local folder. I do the latter one, but the folder is inside my Dropbox too. I can’t vouch for other sync providers, but there’s a good chance Google Drive, OneDrive, Mega and Syncthing are viable options.</p>",
            "author": {
                "name": "Fodi"
            },
            "tags": [
            ],
            "date_published": "2025-08-13T19:56:06+02:00",
            "date_modified": "2025-08-13T19:58:05+02:00"
        },
        {
            "id": "https://ac.gamedev.kitchen/setting-up-construct/",
            "url": "https://ac.gamedev.kitchen/setting-up-construct/",
            "title": "Setting up Construct",
            "summary": "Even though my daily driver is Mozilla Firefox (because I’m an intermediate&hellip;",
            "content_html": "<p>Even though my daily driver is Mozilla Firefox (because I’m an intermediate privacy nut and I wouldn’t want to wonder around today’s Internet without <a href=\"https://addons.mozilla.org/en-US/firefox/addon/ublock-origin\">an uncrippled version of uBlock Origin</a>), I run Construct in Chromium. I chose it because:</p><ol>\n<li>Chromium seems to run games with better performance compared to Firefox. The difference is especially apparent in 3D games, but most of my 2D games also have better FPS on Chromium based browsers.</li>\n<li>I can install Construct as a PWA with it, which comes with a neat launcher icon, a bit more screen space and .c3p file association which is neat. It feels a bit more like a native app.</li>\n<li>Google Chrome and Microsoft Edge are popular browsers and they are both based on Chromium (as are Opera and Brave). If something’s sussy in one of those browsers, it’s probably going to be sussy in all of them.</li>\n<li>Chromium is open source and doesn’t push Google crap, Microsoft crap or cryptocurrencies. At the time of writing :)</li>\n</ol>\n<p>I use the <a href=\"https://github.com/Hibbiki/chromium-win64/\">Chromium build by Hibbiki</a>, which I installed and keep updated with <a href=\"https://scoop.sh/\">scoop</a>. Other alternatives include the <a href=\"https://chromium.woolyss.com/\">Woolyss build</a> and <a href=\"https://github.com/ungoogled-software/ungoogled-chromium\">Ungoogled Chromium</a> but I personally don’t mind the small amount of Google stuff in the build I use, especially because I barely use it for anything other then running Construct.</p><p>If you don’t have concerns about Google Chrome, Microsoft Edge, Opera or Brave, just use any of them, Construct probably runs well in all of them.</p><p>On Windows 10 and newer you also have the option to install Construct 3 from the Microsoft Store; I’m guessing it’s a similar experience to installing the PWA with Microsoft Edge.</p><p>When you open the Construct editor for the first time, it immediately starts downloading the necessary files for offline use and will let you know via a notification in the bottom left when it’s ready.</p><p>If you’re planning to use Construct offline, make sure you open a project and run a preview, as some browsers might prevent Construct from caching the files needed to run projects. Also don’t forget to log in while online before going off the grid.</p>",
            "author": {
                "name": "Fodi"
            },
            "tags": [
            ],
            "date_published": "2025-08-13T19:53:32+02:00",
            "date_modified": "2025-08-13T20:05:53+02:00"
        },
        {
            "id": "https://ac.gamedev.kitchen/introduction/",
            "url": "https://ac.gamedev.kitchen/introduction/",
            "title": "Introduction",
            "summary": "Hi there &amp; welcome to Advanced Construct, an attempt to share knowledge&hellip;",
            "content_html": "<p>Hi there &amp; welcome to Advanced Construct, an attempt to share knowledge I gathered since game development became my hobby in 2020!</p>\n<p>I'm Fodi, a millenial web developer from Hungary. My plan is to contunuosly update this site with articles, hopefully with some videos. Some might age like milk, some might hold up better. But instead of procrastinating or spending too much time with editing, I'm just going to post things.</p>\n<p>If you have feedback, you can find and DM me in the <a href=\"https://discord.gg/g4g3VNsynC\" target=\"_blank\" rel=\"noopener noreferrer\">Consruct Community Discord</a>.</p>",
            "author": {
                "name": "Fodi"
            },
            "tags": [
            ],
            "date_published": "2025-08-13T19:08:52+02:00",
            "date_modified": "2025-08-13T19:08:57+02:00"
        }
    ]
}
